In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 1.02994286,  1.87351153, -0.16752097],
       [ 1.03348486, -1.89051625, -0.55793447],
       [-0.3177941 , -0.94135199, -0.74631902],
       [ 1.89219453, -1.02332847,  0.16789618]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  1.029943  1.873512 -0.167521
1  1.033485 -1.890516 -0.557934
2 -0.317794 -0.941352 -0.746319
3  1.892195 -1.023328  0.167896

In [7]:
dataFrame[0]

0    1.029943
1    1.033485
2   -0.317794
3    1.892195
Name: 0, dtype: float64

In [11]:
newDataFrame = pd.DataFrame(data,index=["erol","serhat","talha","bilo"],columns=["manita","para","cekiciliks"])

In [12]:
newDataFrame

          manita      para  cekiciliks
erol    1.029943  1.873512   -0.167521
serhat  1.033485 -1.890516   -0.557934
talha  -0.317794 -0.941352   -0.746319
bilo    1.892195 -1.023328    0.167896

In [13]:
newDataFrame["manita"]

erol      1.029943
serhat    1.033485
talha    -0.317794
bilo      1.892195
Name: manita, dtype: float64

In [15]:
newDataFrame.loc["erol"]

manita        1.029943
para          1.873512
cekiciliks   -0.167521
Name: erol, dtype: float64

In [17]:
newDataFrame.iloc[1]

manita        1.033485
para         -1.890516
cekiciliks   -0.557934
Name: serhat, dtype: float64

In [18]:
newDataFrame

          manita      para  cekiciliks
erol    1.029943  1.873512   -0.167521
serhat  1.033485 -1.890516   -0.557934
talha  -0.317794 -0.941352   -0.746319
bilo    1.892195 -1.023328    0.167896

In [22]:
newDataFrame["soforluk"] = np.random.randint(0,2,4)

In [23]:
newDataFrame

          manita      para  cekiciliks  soforluk
erol    1.029943  1.873512   -0.167521         0
serhat  1.033485 -1.890516   -0.557934         0
talha  -0.317794 -0.941352   -0.746319         1
bilo    1.892195 -1.023328    0.167896         1

In [25]:
newDataFrame.drop("soforluk",axis=1)

          manita      para  cekiciliks
erol    1.029943  1.873512   -0.167521
serhat  1.033485 -1.890516   -0.557934
talha  -0.317794 -0.941352   -0.746319
bilo    1.892195 -1.023328    0.167896

In [28]:
newDataFrame.drop("bilo",axis=0)

          manita      para  cekiciliks  soforluk
erol    1.029943  1.873512   -0.167521         0
serhat  1.033485 -1.890516   -0.557934         0
talha  -0.317794 -0.941352   -0.746319         1

In [29]:
newDataFrame

          manita      para  cekiciliks  soforluk
erol    1.029943  1.873512   -0.167521         0
serhat  1.033485 -1.890516   -0.557934         0
talha  -0.317794 -0.941352   -0.746319         1
bilo    1.892195 -1.023328    0.167896         1

In [30]:
newDataFrame.drop("bilo",axis=0,inplace=True)

In [31]:
newDataFrame

          manita      para  cekiciliks  soforluk
erol    1.029943  1.873512   -0.167521         0
serhat  1.033485 -1.890516   -0.557934         0
talha  -0.317794 -0.941352   -0.746319         1

In [33]:
 newDataFrame.reset_index()

    index    manita      para  cekiciliks  soforluk
0    erol  1.029943  1.873512   -0.167521         0
1  serhat  1.033485 -1.890516   -0.557934         0
2   talha -0.317794 -0.941352   -0.746319         1

In [34]:
newDataFrame

          manita      para  cekiciliks  soforluk
erol    1.029943  1.873512   -0.167521         0
serhat  1.033485 -1.890516   -0.557934         0
talha  -0.317794 -0.941352   -0.746319         1

In [35]:
newIndexList = ["er","srh","tlh"]

In [36]:
newDataFrame["new Index"] = newIndexList

In [37]:
newDataFrame

          manita      para  cekiciliks  soforluk new Index
erol    1.029943  1.873512   -0.167521         0        er
serhat  1.033485 -1.890516   -0.557934         0       srh
talha  -0.317794 -0.941352   -0.746319         1       tlh

In [38]:
newDataFrame.set_index("new Index")

             manita      para  cekiciliks  soforluk
new Index
er         1.029943  1.873512   -0.167521         0
srh        1.033485 -1.890516   -0.557934         0
tlh       -0.317794 -0.941352   -0.746319         1

In [39]:
newDataFrame

          manita      para  cekiciliks  soforluk new Index
erol    1.029943  1.873512   -0.167521         0        er
serhat  1.033485 -1.890516   -0.557934         0       srh
talha  -0.317794 -0.941352   -0.746319         1       tlh

In [40]:
newDataFrame.set_index("new Index" , inplace=True)

In [41]:
newDataFrame

             manita      para  cekiciliks  soforluk
new Index
er         1.029943  1.873512   -0.167521         0
srh        1.033485 -1.890516   -0.557934         0
tlh       -0.317794 -0.941352   -0.746319         1

In [42]:
firstIndex = ["first","first","first","second","second","second"]

In [43]:
secondIndex =["erol","bilal","serhat","talha","mc","frk"]

In [44]:
combinedIndexes = list(zip(firstIndex,secondIndex))

In [45]:
combinedIndexes

[('first', 'erol'),
 ('first', 'bilal'),
 ('first', 'serhat'),
 ('second', 'talha'),
 ('second', 'mc'),
 ('second', 'frk')]

In [46]:
combinedIndexes = pd.MultiIndex.from_tuples(combinedIndexes)

In [47]:
combinedIndexes

MultiIndex([( 'first',   'erol'),
            ( 'first',  'bilal'),
            ( 'first', 'serhat'),
            ('second',  'talha'),
            ('second',     'mc'),
            ('second',    'frk')],
           )

In [54]:
myMList = [[40,"A"],[50,"B"],[60,"C"],[70,"D"],[80,"E"],[70,"F"]]

In [55]:
myNumpMList = np.array(myMList)

In [56]:
myMDataFrame = pd.DataFrame(myNumpMList,index=combinedIndexes,columns=["dataOne","dataTwo"])

In [57]:
myMDataFrame

              dataOne dataTwo
first  erol        40       A
       bilal       50       B
       serhat      60       C
second talha       70       D
       mc          80       E
       frk         70       F